Repository: openprocurement/openprocurement.integrations.edr
Catalog: docs/source/locale/*/LC_MESSAGES/overview.po
Languages: uk

source: Overview
uk: Огляд

source: The Integrations EDR procedure is plugin to `Open Procurement API <http://api-docs.openprocurement.org/>`_ software.
uk: Integrations EDR процедура це плагін до `Open Procurement API <http://api-docs.openprocurement.org/>`_ software.

source: REST-ful interface to plugin is in line with core software design principles.
uk: REST-ful інтерфейс для плагіна відповідає основним принципам дизайну програмного забезпечення.

source: Conventions
uk: Домовленості

source: This plugin conventions follow the `Open Procurement API conventions <http://api-docs.openprocurement.org/en/latest/overview.html#conventions>`_.
uk: Цей плагін підтримує `домовленності Open Procurement API <http://api-docs.openprocurement.org/en/latest/overview.html#conventions>`_.

source: Main responsibilities
uk: Основні задачі

source: Integrations EDR procedure for obtaining information from the Unified State Register of legal entities and individual entrepreneurs (hereinafter - EDR) by Unified State Register of Enterprises and Organizations of Ukraine (hereinafter - EDRPOU) and Individual tax number (hereinafter - IPN). If you need to find an individual entrepreneur who has no IPN - search performed on the series and passport number.
uk: Процедура інтеграції з ЄДР створена для отримання інформації з Единого Державного Реєстру юридичних осіб та фізичних осіб-підприємців (надалі ЕДР) за номером Єдиного державного реєстру підприємств та організацій України(надалі ЄДРПОУ) для юридичних осіб або Індивідуального податкового номеру ( надалі ІПН ) для фізичної особи-підприємця. Якщо треба знайти фізичну особу-підприємця, яка не має ІПН - пошук проводиться по серії та номеру паспорта).

source: Project status
uk: Стан проекту

source: The project is in active development and has pilot installations.
uk: Цей проект активно розробляється і має пілотні встановлення.

source: The source repository for this project is on GitHub: https://github.com/openprocurement/openprocurement.integrations.edr
uk: Репозиторій цього проекту є на GitHub: https://github.com/openprocurement/openprocurement.integrations.edr

source: You can leave feedback by raising a new issue on the `issue tracker <https://github.com/openprocurement/openprocurement.integrations.edr/issues>`_ (GitHub registration necessary). For general discussion use `Open Procurement General <https://groups.google.com/group/open-procurement-general>`_ maillist.
uk: Повідомляйте про всі проблеми та поради через `issue tracker <https://github.com/openprocurement/openprocurement.integrations.edr/issues>`_ (реєстрація на GitHub обов’язкова). Загальне обговорення відбувається через `розсилку Open Procurement General <https://groups.google.com/group/open-procurement-general>`_ .

source: API stability
uk: Стабільність API

source: API is highly unstable, and while API endpoints are expected to remain relatively stable the data exchange formats are expected to be changed a lot. The changes in the API are communicated via `Open Procurement API maillist <https://groups.google.com/group/open-procurement-api>`_.
uk: API є дуже нестабільним. Хоча точки входу API будуть відносно стабільними, формати обміну даними будуть часно змінюватись. Зміни в API обговорюються через `Open Procurement API розсилку <https://groups.google.com/group/open-procurement-api>`_.

source: Next steps
uk: Наступні кроки

source: You might find it helpful to look at the :ref:`tutorial`.
uk: Далі читайте :ref:`tutorial`.
